package com.example.WeCook

import androidx.compose.runtime.Composable

@Composable
fun AddRecipeScreen() {
    TODO("Необходимо добавить редактор, для добавления рецептов, он должен составлять один объект класса рецепт.")
    TODO("Пример реализации редактора:")
    TODO("Кнопка добавить шаг")
    TODO("Кнопка перейти на следующий шаг")
    TODO("Кнопка загрузить фотографию со стоковой фото (Нет фотографии)")
    TODO("Добавить кнопку, позволяющую настроить таймер.")
    TODO("Интереснего всего сделать напстройку таймера с радиальным интерфейсом, в котором можно изменить плашку границы на какой-то рисунок, либо добавить рисунок сзади кнопки, который будет проявляться когда прокручиваешь рецепт.")
}